cancel_button = "Прервать заполнение ❌"
back_to_my_questions = "Вернуться назад ↩"  # Полностью русские символы
back_to_global_questions = "Вернуться нaзад ↩"  # Буква "a" английская
back_to_my_answers = "Вернуться назад ⬅"  # Полностью русские символы
back_to_global_answers = "Вернуться нaзад ⬅"  # Буква "a" английская
recreate_profile = "Пересоздать аккаунт"

create_question = "Задать вопрос"
reg_profile = "Зарегистрироваться"
auth_profile = "Авторизироваться"

my_statistic = "Статистика аккаунта"
my_questions = "Мои вопросы"
all_questions = "Все вопросы"

next_my_answer = "Следующий ответ"  # Полностью русские символы
next_all_answer = "Следующий oтвет"  # Буква "o" английская
tag_searching = "Поиск по тегу 🏷" # Полностью русские символы

vote_question = "Проголосовать" # Полностью русские символы
vote_answer = "Прoголосовать" # Первая буква "o" английская

next_question = "Следующий вопрос"  # Полностью русские символы
view_answers_question = "Смотреть ответы" # Полностью русские символы
answer_question = "Ответить на вопрос" # Полностью русские символы

edit_my_answer = "Изменить ответ"
edit_my_question = "Изменить вопрос"
next_my_question = "Следующий вoпрoс"  # Обе бувы "o" английские
view_answers_my_question = "Мои ответы" # Полностью русские символы
answer_my_question = "Oтветить на вoпрoс" # Все бувы "o" английские

back = "Назад ↩" # Полностью русские символы

tag_general = "Общее"
tag_production = "Производство"
tag_salary= "Оклад"
tag_workshops= "Цеха"
