crossword = {
    (0, 0): {'hint': 'Часть машины, отвечающая за преобразование энергии', 'answer': 'двигатель', 'guessed': False},
    (0, 4): {'hint': 'Механизм для передачи движения внутри машины', 'answer': 'трансмиссия', 'guessed': False},
    (2, 2): {'hint': 'Устройство для сборки и разборки деталей', 'answer': 'монтажник', 'guessed': False},
    (3, 0): {'hint': 'Тип топлива, используемый внутренними сгораемыми двигателями', 'answer': 'бензин', 'guessed': False},
    (4, 3): {'hint': 'Деталь машины, преобразующая круговое движение в прямолинейное', 'answer': 'шатун', 'guessed': False}
}
