server_error = "<b>💔 Упс..</b>\nНа сервере бота произошла ошибка..."
no_state_but_button_is = "<b>💔 Нет процессов которые можно было бы прервать!</b>n\nДля возвращения в главную панель воспользуйтесь /profile!"
no_state = "Похоже, заполнение формы было прервано и продолжить текущего момента уже не получится!"
slash_on_state = "<b>Нет такого варианта!</b>\nПожалуйста, вернитесь в /profile"

banned = "<b>⛔ Вы находитесь в чёрном списке!</b>\nПричина: {reason}"
no_authorized= "<b>Привет ⭐!</b>\nНеобходимо пройти регистрацию или же авторизироваться!"

not_right_option = "Нет такого варианта!"
